frontend/models/Aneks.php

    public function get_anek($id = 0){
        $this->meta = array(
            "title" => '',
            "description" => '',
            "keywords" => '',
            "h1" => ''
        );


        if($id){
            //$query = "SELECT id, text, rate FROM aneks WHERE id = ".$id;
            $res = Aneks::find()
                ->where(['id' => $id])
                ->one();
---
SELECT * FROM `aneks` WHERE `id`=83322